Project/Toir/src/Reports/торо_ПланФактТрудозатрат/торо_ПланФактТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПланФактТрудозатрат</name>
</mdclass:Report>

Project/Toir/src/AccumulationRegisters/торо_ПлановыеТрудовыеЗатратыРемонтныхРабот/торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПлановыеТрудовыеЗатратыРемонтныхРабот</name>
  <comment>Плановые трудовые затраты ремонтных работ</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеМероприятия</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СоставИерархическихТехКартРемонтов/торо_СоставИерархическихТехКартРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоставИерархическихТехКартРемонтов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состав</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтоимостьЧасаКвалификации/торо_СтоимостьЧасаКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтоимостьЧасаКвалификации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Reports/торо_ПланФактТрудозатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИспользоватьОтборПоПериоду = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодВыполнения")).ИдентификаторПользовательскойНастройки).Использование;
	Если ИспользоватьОтборПоПериоду Тогда
		ПареметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		ПареметрДатаНачала.Использование = Истина;
		ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
		ПараметрДатаОкончания.Использование = Истина;
	Иначе
		ПареметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		ПареметрДатаНачала.Использование = Ложь;
		ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
		ПараметрДатаОкончания.Использование = Ложь;
	КонецЕсли;
	
		Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания", "НаборДанныхТрудозатраты");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхТрудозатраты.Запрос =
		ПолучитьСодержательнуюЧастьЗапросаТрудозатраты()+
		"ВЫБРАТЬ
		|	Вт_ДанныеИтоги.РемонтыОборудования_ID,
		|	Вт_ДанныеИтоги.ОбъектРемонта,
		|	Вт_ДанныеИтоги.ВидРемонта,
		|	Вт_ДанныеИтоги.ДатаНачалаПлан,
		|	Вт_ДанныеИтоги.Документ,
		|	Вт_ДанныеИтоги.ВидДокумента,
		|	Вт_ДанныеИтоги.РемонтнаяРабота,
		|	Вт_ДанныеИтоги.ID,
		|	Вт_ДанныеИтоги.Квалификация,
		|	Вт_ДанныеИтоги.ВремяПлан,
		|	Вт_ДанныеИтоги.КоличествоПлан,
		|	Вт_ДанныеИтоги.СуммаПлан,
		|	Вт_ДанныеИтоги.ДатаНачалаФакт,
		|	Вт_ДанныеИтоги.ВремяФакт,
		|	Вт_ДанныеИтоги.КоличествоФакт,
		|	Вт_ДанныеИтоги.СуммаФакт,
		|	Вт_ДанныеИтоги.ОбъектРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	Вт_ДанныеИтоги КАК Вт_ДанныеИтоги";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхТрудозатраты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапросаТрудозатраты()+
		"ВЫБРАТЬ
		|	Вт_ДанныеИтоги.РемонтыОборудования_ID,
		|	Вт_ДанныеИтоги.ОбъектРемонта,
		|	Вт_ДанныеИтоги.ВидРемонта,
		|	Вт_ДанныеИтоги.ДатаНачалаПлан,
		|	Вт_ДанныеИтоги.Документ,
		|	Вт_ДанныеИтоги.ВидДокумента,
		|	Вт_ДанныеИтоги.РемонтнаяРабота,
		|	Вт_ДанныеИтоги.ID,
		|	Вт_ДанныеИтоги.Квалификация,
		|	Вт_ДанныеИтоги.ВремяПлан,
		|	Вт_ДанныеИтоги.КоличествоПлан,
		|	Вт_ДанныеИтоги.СуммаПлан,
		|	Вт_ДанныеИтоги.ДатаНачалаФакт,
		|	Вт_ДанныеИтоги.ВремяФакт,
		|	Вт_ДанныеИтоги.КоличествоФакт,
		|	Вт_ДанныеИтоги.СуммаФакт,
		|	Вт_ДанныеИтоги.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	Вт_ДанныеИтоги КАК Вт_ДанныеИтоги";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт

	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если (Строка(Элемент.Параметр) = "УчитыватьПланГрафикиППР"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьППР"))Тогда
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьРегламентныеМероприятия"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьРегламентныеМероприятия")) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоДефектам"
				И (Не ПолучитьЗначениеФО("торо_УчетВыявленныхДефектовОборудования")
				ИЛИ Не ПолучитьЗначениеФО("торо_ИспользоватьСметыРемонта")) ) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоВнешнимОснованиям"
				И (Не ПолучитьЗначениеФО("торо_ИспользоватьВнешниеОснованияДляРабот")
				ИЛИ Не ПолучитьЗначениеФО("торо_ИспользоватьСметыРемонта")) ) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь; 
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Если Найти(Форма.ИмяФормы,"НастройкиОтчета") > 0  Тогда
		
		ЭлементыФормы = Форма.Элементы;
		ЭлементГруппаГлавное = ЭлементыФормы.Найти("ОбычныеОтборы");
		Если Не ЭлементГруппаГлавное = Неопределено Тогда
			ЭлементГруппаГлавное.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьЗначениеФО(ТекущаяОпция) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(ТекущаяОпция);
	
КонецФункции

Процедура ПередЗагрузкойНастроекВКомпоновщик(Результат, КлючСхемы, КлючВарианта, НастройкиКД, ПользовательскиеНастройкиКД) Экспорт
	
	Если НастройкиКД = Неопределено Тогда Возврат; КонецЕсли;
	Если ПользовательскиеНастройкиКД = Неопределено Тогда Возврат; КонецЕсли;
	
	Идентификатор = НастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДокумента")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = ПользовательскиеНастройкиКД.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	нИспользование = СтрокаПараметр.Использование; 
	нВидДокумента = ?(нИспользование, СтрокаПараметр.Значение, Ложь);
	
	Для каждого текНастройка из НастройкиКД.Структура Цикл
		Если ТипЗнч(текНастройка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для каждого ТекКолонка из текНастройка.Колонки Цикл
				Если ТекКолонка.имя = "ВидДокумента" Тогда
					ТекКолонка.Использование = нВидДокумента;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСодержательнуюЧастьЗапросаТрудозатраты() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонта,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала КАК ДатаНачалаПлан,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник КАК Документ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник) = ТИП(Документ.торо_ПланГрафикРемонта)
	|			ТОГДА ""План-график ремонта""
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник) = ТИП(Документ.торо_ВыявленныеДефекты)
	|			ТОГДА ""Выявленные дефекты""
	|		КОГДА ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|			ТОГДА ""Предписания""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК ВидДокумента,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.ID КАК РемонтнаяРабота_ID,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация КАК Квалификация,
	|	СУММА(торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.ВремяРаботы * торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Количество) КАК ВремяРаботы,
	|	СУММА(торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Количество) КАК Количество,
	|	СУММА(торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ПлановыеЗатратыЗаявки
	|ИЗ
	|	РегистрНакопления.торо_ПлановыеТрудовыеЗатратыРемонтныхРабот КАК торо_ПлановыеТрудовыеЗатратыРемонтныхРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	|		ПО (торо_ЗаявкаНаРемонтРемонтныеРаботы.Ссылка = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Регистратор)
	|			И (торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник ССЫЛКА Документ.торо_ВыявленныеДефекты
	|					И &РассчетСметПоДефектам
	|				ИЛИ торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|					И &РассчетСметПоВнешнимОснованиям
	|				ИЛИ торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник ССЫЛКА Документ.торо_ПланГрафикРемонта
	|					И &РассчетПланГрафиковППР)
	|			И (торо_ЗаявкаНаРемонтРемонтныеРаботы.ID = торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID)
	|{ГДЕ
	|	(торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.ID,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.Квалификация,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID,
	|	торо_ПлановыеТрудовыеЗатратыРемонтныхРабот.РемонтнаяРабота,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтныеРаботы.ДокументИсточник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПланГрафикППР.ДатаНачалаРемонтныхРабот КАК ДатаНачалаПлан,
	|	торо_ПланГрафикППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПланГрафикППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПланГрафикППР.Регистратор КАК Документ,
	|	торо_ПланГрафикППР.ID КАК ID,
	|	""План-график ремонта"" КАК ВидДокумента
	|ПОМЕСТИТЬ ПлановыеРемонты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ) КАК торо_ПланГрафикППР
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетПланГрафиковППР
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И торо_ПланГрафикППР.Отменен = ЛОЖЬ
	|	И торо_ПланГрафикППР.Замещен = ЛОЖЬ
	|	И НЕ торо_ПланГрафикППР.ID В
	|				(ВЫБРАТЬ
	|					ПлановыеЗатратыЗаявки.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|				ИЗ
	|					ПлановыеЗатратыЗаявки КАК ПлановыеЗатратыЗаявки)
	|{ГДЕ
	|	(торо_ПланГрафикППР.ДатаНачалаРемонтныхРабот МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПлановыеМероприятия.ДатаНачала,
	|	торо_ПлановыеМероприятия.СписокОбъектов,
	|	торо_ПлановыеМероприятия.ВидМероприятия,
	|	торо_ПлановыеМероприятия.Регистратор,
	|	торо_ПлановыеМероприятия.ID,
	|	""Регламентные мероприятия""
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, ) КАК торо_ПлановыеМероприятия
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетРеглМероприятий
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ торо_ПлановыеМероприятия.Отменен
	|{ГДЕ
	|	(торо_ПлановыеМероприятия.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот,
	|	ВидРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	ПлановыеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК ИдТехКарты,
	|	ПлановыеРемонты.ID КАК ID,
	|	ПлановыеРемонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ПлановыеРемонты.Документ КАК Документ,
	|	ПлановыеРемонты.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ НормативныеРемонтыИдентификаторы
	|ИЗ
	|	ПлановыеРемонты КАК ПлановыеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО ПлановыеРемонты.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|			И ПлановыеРемонты.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	|			И (торо_НормативныеРемонтыОборудования.Приоритет)
	|			И (ПлановыеРемонты.Документ ССЫЛКА Документ.торо_ПланГрафикРемонта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
	|	ПлановыеРемонты.ВидРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	ПлановыеРемонты.ID,
	|	ПлановыеРемонты.ДатаНачалаПлан,
	|	ПлановыеРемонты.Документ,
	|	ПлановыеРемонты.ВидДокумента
	|ИЗ
	|	ПлановыеРемонты КАК ПлановыеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_НормативныеРемонтыОборудования
	|		ПО ПлановыеРемонты.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.СписокОбъектов
	|			И ПлановыеРемонты.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидМероприятия
	|			И (ПлановыеРемонты.Документ ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО ПлановыеРемонты.ОбъектРемонтныхРабот = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|			И (ПлановыеРемонты.Документ ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормативныеРемонтыИдентификаторы.ОбъектРемонта КАК ОбъектРемонта,
	|	НормативныеРемонтыИдентификаторы.ВидРемонта КАК ВидРемонта,
	|	НормативныеРемонтыИдентификаторы.ИдТехКарты КАК ИдТехКарты,
	|	НормативныеРемонтыИдентификаторы.ID КАК ID,
	|	НормативныеРемонтыИдентификаторы.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	НормативныеРемонтыИдентификаторы.Документ КАК Документ,
	|	НормативныеРемонтыИдентификаторы.ВидДокумента КАК ВидДокумента,
	|	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК ПериодВерсииТехКарты
	|ПОМЕСТИТЬ ПериодыВерсииТехКарты
	|ИЗ
	|	НормативныеРемонтыИдентификаторы КАК НормативныеРемонтыИдентификаторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО НормативныеРемонтыИдентификаторы.ИдТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|			И НормативныеРемонтыИдентификаторы.ДатаНачалаПлан >= торо_ВерсииТехКарт.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НормативныеРемонтыИдентификаторы.ВидРемонта,
	|	НормативныеРемонтыИдентификаторы.ДатаНачалаПлан,
	|	НормативныеРемонтыИдентификаторы.Документ,
	|	НормативныеРемонтыИдентификаторы.ID,
	|	НормативныеРемонтыИдентификаторы.ВидДокумента,
	|	НормативныеРемонтыИдентификаторы.ОбъектРемонта,
	|	НормативныеРемонтыИдентификаторы.ИдТехКарты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодВерсииТехКарты,
	|	ИдТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПериодыВерсииТехКарты.ОбъектРемонта КАК ОбъектРемонта,
	|	ПериодыВерсииТехКарты.ВидРемонта КАК ВидРемонта,
	|	ПериодыВерсииТехКарты.ID КАК ID,
	|	ПериодыВерсииТехКарты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ПериодыВерсииТехКарты.Документ КАК Документ,
	|	ПериодыВерсииТехКарты.ВидДокумента КАК ВидДокумента,
	|	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта
	|ПОМЕСТИТЬ НормативныеРемонты
	|ИЗ
	|	ПериодыВерсииТехКарты КАК ПериодыВерсииТехКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ПериодыВерсииТехКарты.ПериодВерсииТехКарты = торо_ВерсииТехКарт.Период
	|			И ПериодыВерсииТехКарты.ИдТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормативныеРемонты.ОбъектРемонта КАК ОбъектРемонта,
	|	НормативныеРемонты.ВидРемонта КАК ВидРемонта,
	|	НормативныеРемонты.ID КАК ID,
	|	НормативныеРемонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	НормативныеРемонты.Документ КАК Документ,
	|	НормативныеРемонты.ВидДокумента КАК ВидДокумента,
	|	НормативныеРемонты.ТехКарта КАК Ремонт,
	|	НормативныеРемонты.ТехКарта КАК ТехКарта
	|ПОМЕСТИТЬ НормативныеРемонты_ВсеТехКарты
	|ИЗ
	|	НормативныеРемонты КАК НормативныеРемонты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НормативныеРемонты.ОбъектРемонта,
	|	НормативныеРемонты.ВидРемонта,
	|	НормативныеРемонты.ID,
	|	НормативныеРемонты.ДатаНачалаПлан,
	|	НормативныеРемонты.Документ,
	|	НормативныеРемонты.ВидДокумента,
	|	НормативныеРемонты.ТехКарта,
	|	торо_СоставИерархическихТехКартРемонтов.Состав
	|ИЗ
	|	НормативныеРемонты КАК НормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
	|		ПО НормативныеРемонты.ТехКарта = торо_СоставИерархическихТехКартРемонтов.ТехКарта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормативныеРемонты_ВсеТехКарты.ID КАК РемонтыОборудования_ID,
	|	НормативныеРемонты_ВсеТехКарты.ОбъектРемонта КАК ОбъектРемонта,
	|	НормативныеРемонты_ВсеТехКарты.ВидРемонта КАК ВидРемонта,
	|	НормативныеРемонты_ВсеТехКарты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	НормативныеРемонты_ВсеТехКарты.Документ КАК Документ,
	|	НормативныеРемонты_ВсеТехКарты.ВидДокумента КАК ВидДокумента,
	|	НормативныеРемонты_ВсеТехКарты.Ремонт КАК Ремонт,
	|	торо_ТехКартыТрудовыеЗатраты.Операция КАК РемонтнаяРабота,
	|	торо_ТехКартыТрудовыеЗатраты.ID КАК РемонтнаяРабота_ID,
	|	торо_ТехКартыТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	СУММА(торо_ТехКартыТрудовыеЗатраты.ВремяРаботы * торо_ТехКартыТрудовыеЗатраты.Количество) КАК ВремяРаботы,
	|	торо_ТехКартыТрудовыеЗатраты.Количество КАК Количество
	|ПОМЕСТИТЬ РемонтыСТрудозатратами
	|ИЗ
	|	НормативныеРемонты_ВсеТехКарты КАК НормативныеРемонты_ВсеТехКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТехКартыТрудовыеЗатраты
	|		ПО НормативныеРемонты_ВсеТехКарты.ТехКарта = торо_ТехКартыТрудовыеЗатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НормативныеРемонты_ВсеТехКарты.ДатаНачалаПлан,
	|	НормативныеРемонты_ВсеТехКарты.Ремонт,
	|	НормативныеРемонты_ВсеТехКарты.ВидДокумента,
	|	НормативныеРемонты_ВсеТехКарты.ВидРемонта,
	|	НормативныеРемонты_ВсеТехКарты.Документ,
	|	НормативныеРемонты_ВсеТехКарты.ID,
	|	НормативныеРемонты_ВсеТехКарты.ОбъектРемонта,
	|	торо_ТехКартыТрудовыеЗатраты.Квалификация,
	|	торо_ТехКартыТрудовыеЗатраты.Количество,
	|	торо_ТехКартыТрудовыеЗатраты.Операция,
	|	торо_ТехКартыТрудовыеЗатраты.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	ДатаНачалаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыСТрудозатратами.Квалификация КАК Квалификация,
	|	РемонтыСТрудозатратами.ДатаНачалаПлан КАК ДатаНачалаПлан
	|ПОМЕСТИТЬ ВТ_Квалификации
	|ИЗ
	|	РемонтыСТрудозатратами КАК РемонтыСТрудозатратами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Квалификации.Квалификация КАК Квалификация,
	|	ВТ_Квалификации.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	МАКСИМУМ(торо_СтоимостьЧасаКвалификации.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КвалификацииСПериодамиСреза
	|ИЗ
	|	ВТ_Квалификации КАК ВТ_Квалификации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО ВТ_Квалификации.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	|			И ВТ_Квалификации.ДатаНачалаПлан >= торо_СтоимостьЧасаКвалификации.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Квалификации.Квалификация,
	|	ВТ_Квалификации.ДатаНачалаПлан
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КвалификацииСПериодамиСреза.Квалификация КАК Квалификация,
	|	ВТ_КвалификацииСПериодамиСреза.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	торо_СтоимостьЧасаКвалификации.Валюта КАК Валюта,
	|	торо_СтоимостьЧасаКвалификации.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТ_СтоимостиКвалификаций
	|ИЗ
	|	ВТ_КвалификацииСПериодамиСреза КАК ВТ_КвалификацииСПериодамиСреза
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК торо_СтоимостьЧасаКвалификации
	|		ПО ВТ_КвалификацииСПериодамиСреза.Квалификация = торо_СтоимостьЧасаКвалификации.Квалификация
	|			И ВТ_КвалификацииСПериодамиСреза.Период = торо_СтоимостьЧасаКвалификации.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтоимостиКвалификаций.Квалификация КАК Квалификация,
	|	ВТ_СтоимостиКвалификаций.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВТ_СтоимостиКвалификаций.Валюта КАК Валюта,
	|	ВТ_СтоимостиКвалификаций.Стоимость КАК Стоимость,
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодыСрезаКурсов
	|ИЗ
	|	ВТ_СтоимостиКвалификаций КАК ВТ_СтоимостиКвалификаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_СтоимостиКвалификаций.Валюта = КурсыВалют.Валюта
	|			И ВТ_СтоимостиКвалификаций.ДатаНачалаПлан >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтоимостиКвалификаций.Квалификация,
	|	ВТ_СтоимостиКвалификаций.ДатаНачалаПлан,
	|	ВТ_СтоимостиКвалификаций.Валюта,
	|	ВТ_СтоимостиКвалификаций.Стоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыСрезаКурсов.Квалификация КАК Квалификация,
	|	ВТ_ПериодыСрезаКурсов.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВТ_ПериодыСрезаКурсов.Валюта КАК Валюта,
	|	ВТ_ПериодыСрезаКурсов.Стоимость КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1) = 0
	|			ТОГДА ВТ_ПериодыСрезаКурсов.Стоимость * ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		ИНАЧЕ ВТ_ПериодыСрезаКурсов.Стоимость * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|	КОНЕЦ КАК СтоимостьРуб
	|ПОМЕСТИТЬ ВТ_СтоимостиКвалификацийРуб
	|ИЗ
	|	ВТ_ПериодыСрезаКурсов КАК ВТ_ПериодыСрезаКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ВТ_ПериодыСрезаКурсов.Валюта = КурсыВалют.Валюта
	|			И ВТ_ПериодыСрезаКурсов.Период = КурсыВалют.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Квалификация,
	|	ДатаНачалаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РемонтыСТрудозатратами.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	РемонтыСТрудозатратами.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыСТрудозатратами.ВидРемонта КАК ВидРемонта,
	|	РемонтыСТрудозатратами.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	РемонтыСТрудозатратами.Документ КАК Документ,
	|	РемонтыСТрудозатратами.ВидДокумента КАК ВидДокумента,
	|	РемонтыСТрудозатратами.РемонтнаяРабота КАК РемонтнаяРабота,
	|	РемонтыСТрудозатратами.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
	|	РемонтыСТрудозатратами.Квалификация КАК Квалификация,
	|	РемонтыСТрудозатратами.ВремяРаботы КАК ВремяРаботы,
	|	РемонтыСТрудозатратами.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_СтоимостиКвалификацийРуб.СтоимостьРуб, 0) * РемонтыСТрудозатратами.ВремяРаботы / 3600 КАК Сумма
	|ПОМЕСТИТЬ ПлановыеЗатраты
	|ИЗ
	|	РемонтыСТрудозатратами КАК РемонтыСТрудозатратами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостиКвалификацийРуб КАК ВТ_СтоимостиКвалификацийРуб
	|		ПО РемонтыСТрудозатратами.Квалификация = ВТ_СтоимостиКвалификацийРуб.Квалификация
	|			И РемонтыСТрудозатратами.ДатаНачалаПлан = ВТ_СтоимостиКвалификацийРуб.ДатаНачалаПлан
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеЗатратыЗаявки.РемонтыОборудования_ID,
	|	ПлановыеЗатратыЗаявки.ОбъектРемонта,
	|	ПлановыеЗатратыЗаявки.ВидРемонта,
	|	ПлановыеЗатратыЗаявки.ДатаНачалаПлан,
	|	ПлановыеЗатратыЗаявки.Документ,
	|	ПлановыеЗатратыЗаявки.ВидДокумента,
	|	ПлановыеЗатратыЗаявки.РемонтнаяРабота,
	|	ПлановыеЗатратыЗаявки.РемонтнаяРабота_ID,
	|	ПлановыеЗатратыЗаявки.Квалификация,
	|	ПлановыеЗатратыЗаявки.ВремяРаботы,
	|	ПлановыеЗатратыЗаявки.Количество,
	|	ПлановыеЗатратыЗаявки.Сумма
	|ИЗ
	|	ПлановыеЗатратыЗаявки КАК ПлановыеЗатратыЗаявки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ОбъектРемонта,
	|	РемонтнаяРабота_ID,
	|	Квалификация,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаНачала КАК ДатаНачалаФакт,
	|	""План-график ремонта"" КАК ВидДокумента,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота КАК РемонтнаяРабота,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ID КАК РемонтнаяРабота_ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация КАК Квалификация,
	|	СУММА(ЕСТЬNULL(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ВремяРаботы, 0)) КАК ВремяРаботыФакт,
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Количество) КАК КоличествоФакт,
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Сумма) КАК СуммаФакт
	|ПОМЕСТИТЬ ФактическиеЗатраты
	|ИЗ
	|	РегистрНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот КАК торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|		ПО торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID
	|			И торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Регистратор = торо_ЗавершенныеРемонтныеРаботыСрезПоследних.Регистратор
	|{ГДЕ
	|	(торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ОбъектРемонта,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаНачала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID,
	|	торо_АктОВыполненииРегламентногоМероприятия.ОбъектРемонта,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ВидМероприятия,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ДатаНачала,
	|	""Регламентные мероприятия"",
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация,
	|	СУММА(ЕСТЬNULL(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ВремяРаботы, 0)),
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Количество),
	|	СУММА(торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Сумма)
	|ИЗ
	|	РегистрНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот КАК торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеМероприятияСрезПоследних
	|		ПО торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID = торо_ЗавершенныеМероприятияСрезПоследних.ID
	|			И торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Регистратор = торо_ЗавершенныеМероприятияСрезПоследних.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.МероприятияОбъектов КАК торо_АктОВыполненииРегламентногоМероприятия
	|		ПО торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Регистратор = торо_АктОВыполненииРегламентногоМероприятия.Ссылка
	|			И торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID = торо_АктОВыполненииРегламентногоМероприятия.Мероприятие_ID
	|{ГДЕ
	|	(торо_ЗавершенныеМероприятияСрезПоследних.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания)}
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтыОборудования_ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.Квалификация,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.ID,
	|	торо_ФактическиеТрудовыеЗатратыРемонтныхРаботОбороты.РемонтнаяРабота,
	|	торо_АктОВыполненииРегламентногоМероприятия.ОбъектРемонта,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ВидМероприятия,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ДатаНачала
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(таб.Регистратор) КАК Регистратор,
	|	таб.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ДокументыПланаДляФактТрудозатрат
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК таб
	|ГДЕ
	|	(таб.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
	|			ИЛИ таб.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|			ИЛИ таб.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	|			ИЛИ таб.Регистратор ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|	И таб.ID В
	|			(ВЫБРАТЬ
	|				ФактическиеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID
	|			ИЗ
	|				ФактическиеЗатраты КАК ФактическиеЗатраты)
	|
	|СГРУППИРОВАТЬ ПО
	|	таб.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеЗатраты.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	ФактическиеЗатраты.ОбъектРемонта КАК ОбъектРемонта,
	|	ФактическиеЗатраты.ВидРемонта КАК ВидРемонта,
	|	ФактическиеЗатраты.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	|			ТОГДА ""План-график ремонта""
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	|			ТОГДА ""Выявленные дефекты""
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|			ТОГДА ""Предписания""
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|			ТОГДА ""Регламентные мероприятия""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК ВидДокумента,
	|	ФактическиеЗатраты.РемонтнаяРабота КАК РемонтнаяРабота,
	|	ФактическиеЗатраты.РемонтнаяРабота_ID КАК РемонтнаяРабота_ID,
	|	ФактическиеЗатраты.Квалификация КАК Квалификация,
	|	ФактическиеЗатраты.ВремяРаботыФакт КАК ВремяРаботыФакт,
	|	ФактическиеЗатраты.КоличествоФакт КАК КоличествоФакт,
	|	ФактическиеЗатраты.СуммаФакт КАК СуммаФакт
	|ПОМЕСТИТЬ ФактТрудозатратыСПланом
	|ИЗ
	|	ФактическиеЗатраты КАК ФактическиеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыПланаДляФактТрудозатрат КАК ВТ_ДокументыПланаДляФактТрудозатрат
	|		ПО ФактическиеЗатраты.РемонтыОборудования_ID = ВТ_ДокументыПланаДляФактТрудозатрат.ID
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ПланГрафикРемонта)
	|					И &РассчетПланГрафиковППР = ИСТИНА
	|				ТОГДА ИСТИНА
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	|					И &РассчетСметПоДефектам = ИСТИНА
	|				ТОГДА ИСТИНА
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот)
	|					И &РассчетСметПоВнешнимОснованиям = ИСТИНА
	|				ТОГДА ИСТИНА
	|			КОГДА ТИПЗНАЧЕНИЯ(ВТ_ДокументыПланаДляФактТрудозатрат.Регистратор) = ТИП(Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	|					И &РассчетРеглМероприятий = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РемонтыОборудования_ID,
	|	ОбъектРемонта,
	|	РемонтнаяРабота_ID,
	|	Квалификация,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПлановыеЗатраты.РемонтыОборудования_ID, ФактическиеЗатраты.РемонтыОборудования_ID) КАК РемонтыОборудования_ID,
	|	ЕСТЬNULL(ПлановыеЗатраты.ОбъектРемонта, ФактическиеЗатраты.ОбъектРемонта) КАК ОбъектРемонта,
	|	ЕСТЬNULL(ПлановыеЗатраты.ВидРемонта, ФактическиеЗатраты.ВидРемонта) КАК ВидРемонта,
	|	ЕСТЬNULL(ПлановыеЗатраты.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан,
	|	ЕСТЬNULL(ПлановыеЗатраты.Документ, ФактическиеЗатраты.Документ) КАК Документ,
	|	ЕСТЬNULL(ПлановыеЗатраты.ВидДокумента, ФактическиеЗатраты.ВидДокумента) КАК ВидДокумента,
	|	ЕСТЬNULL(ПлановыеЗатраты.РемонтнаяРабота, ФактическиеЗатраты.РемонтнаяРабота) КАК РемонтнаяРабота,
	|	ЕСТЬNULL(ПлановыеЗатраты.РемонтнаяРабота_ID, ФактическиеЗатраты.РемонтнаяРабота_ID) КАК ID,
	|	ЕСТЬNULL(ПлановыеЗатраты.Квалификация, ФактическиеЗатраты.Квалификация) КАК Квалификация,
	|	ЕСТЬNULL(ПлановыеЗатраты.ВремяРаботы, 0) КАК ВремяПлан,
	|	ЕСТЬNULL(ПлановыеЗатраты.Количество, 0) КАК КоличествоПлан,
	|	ЕСТЬNULL(ПлановыеЗатраты.Сумма, 0) КАК СуммаПлан,
	|	ЕСТЬNULL(ФактическиеЗатраты.ДатаНачалаФакт, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаФакт,
	|	ЕСТЬNULL(ФактическиеЗатраты.ВремяРаботыФакт, 0) КАК ВремяФакт,
	|	ЕСТЬNULL(ФактическиеЗатраты.КоличествоФакт, 0) КАК КоличествоФакт,
	|	ЕСТЬNULL(ФактическиеЗатраты.СуммаФакт, 0) КАК СуммаФакт
	|ПОМЕСТИТЬ Вт_ДанныеИтогиПредв
	|ИЗ
	|	ПлановыеЗатраты КАК ПлановыеЗатраты
	|		ПОЛНОЕ СОЕДИНЕНИЕ ФактТрудозатратыСПланом КАК ФактическиеЗатраты
	|		ПО ПлановыеЗатраты.РемонтыОборудования_ID = ФактическиеЗатраты.РемонтыОборудования_ID
	|			И ПлановыеЗатраты.ОбъектРемонта = ФактическиеЗатраты.ОбъектРемонта
	|			И ПлановыеЗатраты.РемонтнаяРабота_ID = ФактическиеЗатраты.РемонтнаяРабота_ID
	|			И ПлановыеЗатраты.Квалификация = ФактическиеЗатраты.Квалификация
	|			И ПлановыеЗатраты.Документ = ФактическиеЗатраты.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Вт_ДанныеИтогиПредв.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
	|	Вт_ДанныеИтогиПредв.ВидРемонта КАК ВидРемонта,
	|	Вт_ДанныеИтогиПредв.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	Вт_ДанныеИтогиПредв.Документ КАК Документ,
	|	Вт_ДанныеИтогиПредв.ВидДокумента КАК ВидДокумента,
	|	Вт_ДанныеИтогиПредв.РемонтнаяРабота КАК РемонтнаяРабота,
	|	Вт_ДанныеИтогиПредв.ID КАК ID,
	|	Вт_ДанныеИтогиПредв.Квалификация КАК Квалификация,
	|	Вт_ДанныеИтогиПредв.ВремяПлан КАК ВремяПлан,
	|	Вт_ДанныеИтогиПредв.КоличествоПлан КАК КоличествоПлан,
	|	Вт_ДанныеИтогиПредв.СуммаПлан КАК СуммаПлан,
	|	Вт_ДанныеИтогиПредв.ДатаНачалаФакт КАК ДатаНачалаФакт,
	|	Вт_ДанныеИтогиПредв.ВремяФакт КАК ВремяФакт,
	|	Вт_ДанныеИтогиПредв.КоличествоФакт КАК КоличествоФакт,
	|	Вт_ДанныеИтогиПредв.СуммаФакт КАК СуммаФакт
	|ПОМЕСТИТЬ Вт_ДанныеИтоги
	|ИЗ
	|	Вт_ДанныеИтогиПредв КАК Вт_ДанныеИтогиПредв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО Вт_ДанныеИтогиПредв.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка"
	
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли
